public_html/articles/emacs/minor.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#unnumbered-1">Настройка</a></li>
</ul>
</div>
</div>
<p>
Теперь мы поставим еще парочку расширений. Ставятся они тривиально, поэтому привожу только
код. highlight-parentheses раскрашивает скобки в разные цвета для удобного ориенитрования в
elist и lisp коде, а closure-template-html-mode - это специальный режим для редактирование
html-шаблонов. iswitchb дополняет ido-mode, о чем подробно можно прочесть в emacswiki (ссылка
приведена в комментариях)
</p>

<heading id="outline-container-unnumbered-1" class="outline-2">
<h2 id="unnumbered-1">Настройка</h2>
<div class="outline-text-2" id="text-unnumbered-1">
<p>
&lt;source lang="lisp&gt;
HIGHLIHT-PARENTHESES
;; <a href="http://nschum.de/src/emacs/highlight-parentheses/highlight-parentheses.el">http://nschum.de/src/emacs/highlight-parentheses/highlight-parentheses.el</a>
(require 'highlight-parentheses)
;; (add-hook 'lisp-mode-hook (highlight-parentheses-mode))
(define-globalized-minor-mode global-highlight-parentheses-mode
    highlight-parentheses-mode highlight-parentheses-mode)
(setq hl-paren-colors
'("#FF0000" "#FFBF00" "#1FFF00" "#009EFF" "#2100FF" "gray10" "gray70" "gray90"))
(global-highlight-parentheses-mode)
</p>


<p>
;; CLOSURE-TEMPLATE-HTML-MODE
;; <a href="http://github.com/archimag/cl-closure-template/raw/master/closure-template-html-mode.el">http://github.com/archimag/cl-closure-template/raw/master/closure-template-html-mode.el</a>
(require 'closure-template-html-mode)
</p>


<p>
;; ISWITCHB <a href="http://www.emacswiki.org/emacs/IswitchBuffers">http://www.emacswiki.org/emacs/IswitchBuffers</a>
(require 'iswitchb)
(defun iswitchb-local-keys ()
  (mapc (lambda (K)
          (let* ((key (car K)) (fun (cdr K)))
            (define-key iswitchb-mode-map (edmacro-parse-keys key) fun)))
        '(("&lt;right&gt;" . iswitchb-next-match)
          ("&lt;left&gt;"  . iswitchb-prev-match)
          ("&lt;up&gt;"    . ignore             )
          ("&lt;down&gt;"  . ignore             ))))
(add-hook 'iswitchb-define-mode-map-hook 'iswitchb-local-keys)
;; <a href="http://www.emacswiki.org/emacs/IswitchBuffers">http://www.emacswiki.org/emacs/IswitchBuffers</a>
(defadvice iswitchb-kill-buffer (after rescan-after-kill activate)
  "*Regenerate the list of matching buffer names after a kill.
    Necessary if using `uniquify' with `uniquify-after-kill-buffer-p'
    set to non-nil."
  (setq iswitchb-buflist iswitchb-matches)
  (iswitchb-rescan))
;; <a href="http://www.emacswiki.org/emacs/IswitchBuffers">http://www.emacswiki.org/emacs/IswitchBuffers</a>
(defun iswitchb-rescan ()
  "*Regenerate the list of matching buffer names."
  (interactive)
  (iswitchb-make-buflist iswitchb-default)
  (setq iswitchb-rescan t))
&lt;/source&gt;
</p>
</div>
</heading>
